CourseProject_V3/runs/mesh-2026-09-13T19-48-11-319Z/case/0/k
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 5.553269631207509e-05;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 5.553269631207509e-05;
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            kqRWallFunction;
        value           uniform 5.553269631207509e-05;
    }
    obstacles
    {
        type            kqRWallFunction;
        value           uniform 5.553269631207509e-05;
    }
    frontAndBack
    {
        type            empty;
    }
}
